## Link to course
### https://www.linkedin.com/learning/python-for-data-visualization-2023/basics-of-matplotlib?autoSkip=true&resume=false&u=36836804

In [12]:
import numpy as np
import pandas as pd

## Read data

In [13]:
data = pd.read_csv('/Users/cemakay/DataScience/Jupyter/LinkedIn/Car/data/car_financing.csv')
data

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60.0,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60.0,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60.0,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60.0,0.0702,Toyota Sienna
4,5,32735.70,687.23,NaN,495.73,32239.97,60.0,0.0702,Toyota Sienna
...,...,...,...,...,...,...,...,...,...
403,56,3951.11,796.01,9.54,786.47,3164.64,60.0,0.0290,VW Golf R
404,57,3164.64,796.01,7.64,788.37,2376.27,60.0,0.0290,VW Golf R
405,58,2376.27,796.01,5.74,790.27,1586.00,60.0,0.0290,VW Golf R
406,59,1586.00,796.01,3.83,792.18,793.82,60.0,0.0290,VW Golf R
407,60,793.82,796.01,1.91,794.10,-0.28,60.0,0.0290,VW Golf R

## Slicing

In [14]:
data[data.columns[[1]]][0:10]

   Starting Balance
0          34689.96
1          34205.66
2          33718.53
3          33228.55
4          32735.70
5          32239.97
6          31741.34
7          31239.79
8          30735.31
9          30227.88

In [15]:
data.loc[:9 , ['Starting Balance']]

   Starting Balance
0          34689.96
1          34205.66
2          33718.53
3          33228.55
4          32735.70
5          32239.97
6          31741.34
7          31239.79
8          30735.31
9          30227.88

## Filtering

In [16]:
data[(data.interest_rate == 0.0290) & (data.car_type == 'VW Golf R')]

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
264,1,44409.60,1289.53,107.32,1182.21,43227.39,36.0,0.029,VW Golf R
265,2,43227.39,1289.53,104.46,1185.07,42042.32,36.0,0.029,VW Golf R
266,3,42042.32,1289.53,101.60,1187.93,40854.39,36.0,0.029,VW Golf R
267,4,40854.39,1289.53,98.73,1190.80,39663.59,36.0,0.029,VW Golf R
268,5,39663.59,1289.53,95.85,1193.68,38469.91,36.0,0.029,VW Golf R
...,...,...,...,...,...,...,...,...,...
403,56,3951.11,796.01,9.54,786.47,3164.64,60.0,0.029,VW Golf R
404,57,3164.64,796.01,7.64,788.37,2376.27,60.0,0.029,VW Golf R
405,58,2376.27,796.01,5.74,790.27,1586.00,60.0,0.029,VW Golf R
406,59,1586.00,796.01,3.83,792.18,793.82,60.0,0.029,VW Golf R
407,60,793.82,796.01,1.91,794.10,-0.28,60.0,0.029,VW Golf R

In [17]:
carfilter = data.car_type == 'VW Golf R'
intfilter = data.interest_rate == 0.0290

subset = data.loc[carfilter&intfilter,:]
subset['Interest Paid'].sum()

8042.85

## Rename columns

In [18]:
data = data.rename(columns={
                    data.columns[1]: 'starting_balance',
                    data.columns[3]: 'interest_paid',
                    data.columns[4]: 'principal_paid',
                    data.columns[5]: 'new_balance'})

In [19]:
# list method to rename
data.columns = ['month', 'starting_balance', 'Repayment', 'interest_paid',
       'principal_paid', 'new_balance', 'term', 'interest_rate', 'car_type']

## Aggregate functions

In [20]:
data.agg({'starting_balance': ['min', 'max', 'mean'],
         'Repayment': ['min', 'max']}).fillna('Not used')

      starting_balance Repayment
min         395.410000    396.82
max       44409.600000   1289.53
mean      17562.870343  Not used

In [21]:
interest_paid = data.groupby(data.car_type)[['interest_paid']].sum()
interest_paid.loc['Total'] = interest_paid.interest_paid.sum()
interest_paid

                interest_paid
car_type
Toyota Carolla        4066.53
Toyota Corolla        1229.00
Toyota Sienna         9349.74
VW Golf R             8042.85
Total                22688.12

In [22]:
data.sum()

month                                                           11004
starting_balance                                            7165651.1
Repayment                                                   290550.72
interest_paid                                                22688.12
principal_paid                                              267410.95
new_balance                                                6898240.15
term                                                          21480.0
interest_rate                                                  16.158
car_type            Toyota SiennaToyota SiennaToyota SiennaToyota ...
dtype: object

## Missing values

In [23]:
#Overview of all columns
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 408 entries, 0 to 407
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   month             408 non-null    int64
 1   starting_balance  408 non-null    float64
 2   Repayment         408 non-null    float64
 3   interest_paid     405 non-null    float64
 4   principal_paid    408 non-null    float64
 5   new_balance       408 non-null    float64
 6   term              406 non-null    float64
 7   interest_rate     408 non-null    float64
 8   car_type          408 non-null    object
dtypes: float64(7), int64(1), object(1)
memory usage: 28.8+ KB

In [24]:
#Detect where thic condition is True
nanterm = data.term.isna()
nanterm

0      False
1      False
2      False
3      False
4      False
       ...
403    False
404    False
405    False
406    False
407    False
Name: term, Length: 408, dtype: bool

In [25]:
# see rows with null values
data.loc[nanterm, :]

,month,starting_balance,Repayment,interest_paid,principal_paid,new_balance,term,interest_rate,car_type
6,7,31741.34,687.23,185.68,501.55,31239.79,NaN,0.0702,Toyota Sienna
14,15,27645.84,687.23,161.72,525.51,27120.33,NaN,0.0702,Toyota Sienna

In [26]:
#another method
data[data.term.isnull()]

,month,starting_balance,Repayment,interest_paid,principal_paid,new_balance,term,interest_rate,car_type
6,7,31741.34,687.23,185.68,501.55,31239.79,NaN,0.0702,Toyota Sienna
14,15,27645.84,687.23,161.72,525.51,27120.33,NaN,0.0702,Toyota Sienna

In [27]:
#another method
data[data.isnull().any(axis=1)]

,month,starting_balance,Repayment,interest_paid,principal_paid,new_balance,term,interest_rate,car_type
4,5,32735.70,687.23,NaN,495.73,32239.97,60.0,0.0702,Toyota Sienna
6,7,31741.34,687.23,185.68,501.55,31239.79,NaN,0.0702,Toyota Sienna
14,15,27645.84,687.23,161.72,525.51,27120.33,NaN,0.0702,Toyota Sienna
21,22,23902.11,687.23,NaN,547.41,23354.70,60.0,0.0702,Toyota Sienna
27,28,20569.25,687.23,NaN,566.90,20002.35,60.0,0.0702,Toyota Sienna

In [28]:
#Multiple boolean conditions
pay = data.interest_paid < 10
newbal = data.new_balance < 1000
intrate = data.interest_rate == 0.0290

data.loc[pay&newbal&intrate,:]

,month,starting_balance,Repayment,interest_paid,principal_paid,new_balance,term,interest_rate,car_type
299,36,1286.21,1289.53,3.10,1286.43,-0.22,36.0,0.029,VW Golf R
346,47,1954.47,981.02,4.72,976.30,978.17,48.0,0.029,VW Golf R
347,48,978.17,981.02,2.36,978.66,-0.49,48.0,0.029,VW Golf R
406,59,1586.00,796.01,3.83,792.18,793.82,60.0,0.029,VW Golf R
407,60,793.82,796.01,1.91,794.10,-0.28,60.0,0.029,VW Golf R

## Remove or fill missing data/values

In [29]:
#fill with the value just after the null value 
data.term = data.term.fillna(data.term.bfill())

In [30]:
data.interest_paid = data.interest_paid.interpolate()

## Convert Pandas DataFrames

In [31]:
cal = pd.read_csv('/Users/cemakay/Downloads/calories.csv')
type(cal)

pandas.core.frame.DataFrame

In [32]:
tonumpy = cal.values # to numpy

In [33]:
tonump = cal.to_numpy() # to numpy

In [34]:
caltotict = cal.to_dict()

## Export DataFrames

In [35]:
# can use to_csv or to_excel

## Matplotlib

In [36]:
import matplotlib.pyplot as plt
import seaborn as sns

In [37]:
mo = data.month.values
type(mo)

numpy.ndarray

In [38]:
plt.style.available

['Solarize_Light2',
 '_classic_test_patch',
 '_mpl-gallery',
 '_mpl-gallery-nogrid',
 'bmh',
 'classic',
 'dark_background',
 'fast',
 'fivethirtyeight',
 'ggplot',
 'grayscale',
 'seaborn-v0_8',
 'seaborn-v0_8-bright',
 'seaborn-v0_8-colorblind',
 'seaborn-v0_8-dark',
 'seaborn-v0_8-dark-palette',
 'seaborn-v0_8-darkgrid',
 'seaborn-v0_8-deep',
 'seaborn-v0_8-muted',
 'seaborn-v0_8-notebook',
 'seaborn-v0_8-paper',
 'seaborn-v0_8-pastel',
 'seaborn-v0_8-poster',
 'seaborn-v0_8-talk',
 'seaborn-v0_8-ticks',
 'seaborn-v0_8-white',
 'seaborn-v0_8-whitegrid',
 'tableau-colorblind10']

In [39]:
plt.style.use('classic')